/******************************************************************************************
* Data Structures in C++
* ISBN: 7-302-33064-6 & 7-302-33065-3 & 7-302-29652-2 & 7-302-26883-3
* Johnny Li, 707328350@qq.com
* ~
* Copyright (c) 2019-2020. All rights reserved.
******************************************************************************************/
/******************************************************************************************
* 二叉树的后序遍历，DFS的思想（利用栈记录）.
******************************************************************************************/

template <typename T, typename VST>
void travPost_I2(BinNodePosi<T> x, VST& visit) {
	stack<BinNodePosi<T>> S;
	BinNodePosi<T> prec = NULL;  //用来记录x的前驱，初始化为空
	while (TRUE) {
		if (NULL != x) {
			S.push(x);
			x = x->lc;
		} else if (!S.empty()) {
			x = S.top(); 
			if (NULL == X->rc || prec = x->rc) { //节点没有右孩子，或者右孩子已经被访问(被标记过)
				visit(x->data);
				prec = x;  //记录当前访问的节点，是下一个访问节点的前驱
				S.pop();  
				x = NULL;
			} else {
				x = x->rc;
			}
		} else {
			break;
		}
	}
}