/******************************************************************************************
* Data Structures in C++
* ISBN: 7-302-33064-6 & 7-302-33065-3 & 7-302-29652-2 & 7-302-26883-3
* Johnny Li, 707328350@qq.com
* ~
* Copyright (c) 2019-2020. All rights reserved.
******************************************************************************************/
/******************************************************************************************
* 二叉树的前序遍历，DFS的思想（利用栈记录）.
******************************************************************************************/

template <typename T, typename VST>
void travPrec_I2(BinNodePosi<T> x, VST& visit) {
	stack<BinNodePosi<T>> S;
	while (TRUE) {
		if (NULL != x) {
			S.push(x);
			visit(x->data);
			x = x->lc;
		} else if (!S.empty()) {
			x = S.top(); S.pop();
			x = x->rc;
		} else {
			break;
		}
	}
}