/******************************************************************************************
* Data Structures in C++
* ISBN: 7-302-33064-6 & 7-302-33065-3 & 7-302-29652-2 & 7-302-26883-3
* Johnny Li, 707328350@qq.com
* ~
* Copyright (c) 2019-2020. All rights reserved.
******************************************************************************************/ 
/******************************************************************************************
* 二叉树的直接后继及其定位
******************************************************************************************/ 
template <typename T>
BinNodePosi<T> BinTree<T>::succ() {
	BinNodePosi<T> s = this;
	if (NULL != rc) { //若有右子树，则直接后继必定在右子树中
		s = rc;
		while (HasLChild(*s)) s = s->lc;  //右子树中，最深且最靠左的节点为直接后继
	} else {  //若没有右子树，则直接后继为，将直接后继为将当前节点所在子树作为左子树的最低祖先。
		while (IsRChild(*s)) s = s->parent;  //向上查找祖先，直到该祖先不是右子树
		s = s->parent;
	}
	return s;
}