/******************************************************************************************
* Data Structures in C++
* ISBN: 7-302-33064-6 & 7-302-33065-3 & 7-302-29652-2 & 7-302-26883-3
* Johnny Li, 707328350@qq.com
* ~
* Copyright (c) 2019-2020. All rights reserved.
******************************************************************************************/ 
/******************************************************************************************
* 二叉树的中序遍历迭代版2，利用栈记录所有的左孩子，直到没有左孩子开始处理栈中的节点.
******************************************************************************************/ 
template <typename T,typename VST>
void trav_I2(BinNodePosi<T> x, VST& visit) {
	Stack<BinNodePosi<T>> S;
	while (TRUE) {
		if (NULL != x) {
			S.push(x);
			x = x->lc;
		} else if (!S.empty()){
			x = S.top();S.pop();
			visit(x->data);
			x = x->rc;
		} else {
			break;
		}
	}
}