/******************************************************************************************
* Data Structures in C++
* ISBN: 7-302-33064-6 & 7-302-33065-3 & 7-302-29652-2 & 7-302-26883-3
* Johnny Li, 707328350@qq.com
* ~
* Copyright (c) 2019-2020. All rights reserved.
******************************************************************************************/ 

/******************************************************************************************
* 子树的分离:将子树x从当前树中摘除，将其封装为一颗独立子树返回
******************************************************************************************/ 

template <typename T>
BinTree<T>* BinTree<T>::secede(BinNodePosi(T) x) {
	FromParentTo(*x) = NULL;  //切断来自父节点的指针
	updateHeightAbove(x->parent);  //更新原树中所有祖先的高度
	BinTree<T>* S = new BinTree<T>;  //申请新的书
	S->root_ = x;  //新的树的根为x
	x->parent = NULL;  //x作为新的树根没有父节点
	S->size_ = x->size();  //更新新树的规模
	size_ -= S->size;  //更新原树的规模
	return S;  //返回新树
}